
""" Таблица к уроку по literal and symbol class"""

print('+{:-^18}+{:-^130}+'.format('-', '-'))
print('|{: ^18}|{: ^130}|'.format('Символ', 'Описание'))
print('+{:-^18}+{:-^130}+'.format('-', '-'))
print('|{: ^18}|{: ^130}|'.format('.', 'Соответствует любому символу кроме \\n, '
                                       'если установлен флаг re.DOTALL то обсоллютно любому символу,'
                                       ' или "." если в [.]'))
print('+{:-^18}+{:-^130}+'.format('-', '-'))
print('|{: ^18}|{: ^130}|'.format('\d', 'Соответствует любой цифре, если установлен флаг re.ASCII то диапазону [0-9]'))
print('+{:-^18}+{:-^130}+'.format('-', '-'))
print('|{: ^18}|{: ^130}|'.format('\D', 'Соответствует любой НЕ цифре, если установлен флаг re.ASCII'
                                        'то аналогичен [^0-9]'))
print('+{:-^18}+{:-^130}+'.format('-', '-'))
print('|{: ^18}|{: ^130}|'.format('\s', 'Любой пробельный символ. Для re.ASCII-символьному классу [_\\t\\n\\r\\f\\v]'))
print('+{:-^18}+{:-^130}+'.format('-', '-'))
print('|{: ^18}|{: ^130}|'.format('\S', 'Любой НЕ пробельный символ. Для re.ASCII-символьному классу [^\\t\\n\\r\\f\\v]'))
print('+{:-^18}+{:-^130}+'.format('-', '-'))
print('|{: ^18}|{: ^130}|'.format('\w', 'Любому символу слова. Для re.ASCII - соответствует [a-zA-Z0-9]'))
print('+{:-^18}+{:-^130}+'.format('-', '-'))
print('|{: ^18}|{: ^130}|'.format('\W', 'НЕ любому символу слова. Для re.ASCII - соответствует [^a-zA-Z0-9]'))
print('+{:-^18}+{:-^130}+'.format('-', '-'))
